#pragma once

// Fortnite (1.8) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct SupplyDropUnlocks.SupplyDropUnlocks
// 0x0005
struct FSupplyDropUnlocks
{
	bool                                               TierOne_5_9D1EB309486DD183FED684B8EEAF54B7;               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TierTwo_6_58AB58B441DB6EDC4FEA21ABD0C17475;               // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TierThree_7_F54FF5FC4D92FACF83CB69B88043A65F;             // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TierFour_8_6C40909A4282BD0806479A8DD34449EB;              // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TierFive_9_0B433AC44B7DBA126B7872BD5EC513DA;              // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
